# MullionsWillBeDeleted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..MullionsWillBeDeleted Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
The Mullions between the Panels being joined will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MullionsWillBeDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MullionsWillBeDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MullionsWillBeDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace